openfoam/unit_cell/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

castellatedMesh true;
snap            true;
addLayers       true;

geometry
{
    // STL 파일명은 Python 스크립트에서 자동 치환됨
    netSurface.stl
    {
        type    triSurfaceMesh;
        name    netSurface;
    }
}

castellatedMeshControls
{
    maxLocalCells       2000000;
    maxGlobalCells      10000000;
    minRefinementCells  10;
    maxLoadUnbalance    0.10;
    nCellsBetweenLevels 3;

    features
    (
        {
            file    "netSurface.eMesh";
            level   3;
        }
    );

    refinementSurfaces
    {
        netSurface
        {
            // 그물발 표면: 레벨 3~5 (직경 대비 충분한 해상도)
            level (3 5);
            patchInfo
            {
                type    wall;
                inGroups (wall);
            }
        }
    }

    refinementRegions
    {
        netSurface
        {
            mode    inside;
            levels  ((1e-3 5));  // 그물발 직경 수준 이내 최고 해상도
        }
    }

    // 도메인 내부 점 (격자 내부 기준점)
    locationInMesh (0 0 0);

    allowFreeStandingZoneFaces true;
}

snapControls
{
    nSmoothPatch        3;
    tolerance           2.0;
    nSolveIter          30;
    nRelaxIter          5;
    nFeatureSnapIter    10;
    implicitFeatureSnap false;
    explicitFeatureSnap true;
    multiRegionFeatureSnap false;
}

addLayersControls
{
    relativeSizes       true;
    layers
    {
        netSurface
        {
            nSurfaceLayers  3;
        }
    }
    expansionRatio          1.2;
    finalLayerThickness     0.3;
    minThickness            0.1;
    nGrow                   0;
    featureAngle            60;
    nRelaxIter              3;
    nSmoothSurfaceNormals   1;
    nSmoothNormals          3;
    nSmoothThickness        10;
    maxFaceThicknessRatio   0.5;
    maxThicknessToMedialRatio 0.3;
    minMedialAxisAngle      90;
    nBufferCellsNoExtrude   0;
    nLayerIter              50;
}

meshQualityControls
{
    maxNonOrtho             65;
    maxBoundarySkewness     20;
    maxInternalSkewness     4;
    maxConcave              80;
    minVol                  1e-13;
    minTetQuality           1e-15;
    minArea                 -1;
    minTwist                0.02;
    minDeterminant          0.001;
    minFaceWeight           0.05;
    minVolRatio             0.01;
    minTriangleTwist        -1;
    nSmoothScale            4;
    errorReduction          0.75;
}

writeFlags
(
    scalarLevels
    meshQuality
);

mergeTolerance 1e-6;

// ************************************************************************* //
