openfoam/unit_cell/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// 해수 물성치 (15°C 기준)

transportModel  Newtonian;

// 동점성계수 (kinematic viscosity) [m^2/s]
// 해수 15°C: nu ≈ 1.19e-6 m^2/s
nu              1.19e-6;

// ************************************************************************* //
