openfoam/unit_cell/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// RTX 3090 x2 기준: CPU 코어 수에 맞게 분할
// 권장: 물리 코어 수 (예: 16코어 CPU → numberOfSubdomains 16)
// GPU 가속은 AmgX 라이브러리를 통해 선형 솔버 단계에서 별도 적용

numberOfSubdomains  16;   // Python에서 자동으로 CPU 코어 수에 맞게 교체됨

method          scotch;   // 자동 도메인 분할 (METIS보다 설치 용이)

// scotch 대신 계층적 분할 사용 시:
// method       hierarchical;
// hierarchicalCoeffs
// {
//     n        (4 2 2);   // x:4 y:2 z:2 = 16 프로세스
//     delta    0.001;
//     order    xyz;
// }

// ************************************************************************* //
